
<html>

<head>

<meta charset="utf-8" />
<meta name="generator" content="pandoc" />
<meta http-equiv="X-UA-Compatible" content="IE=EDGE" />


<title>Monitoreo del Contagio de COVID-19 en M&eacute;xico: Numeros B&aacute;sicos de Reproducci&oacute;n en el tiempo</title>

<script src="html_libraries/header-attrs-2.2/header-attrs.js"></script>
<script src="html_libraries/jquery-1.11.3/jquery.min.js"></script>
<meta name="viewport" content="width=device-width, initial-scale=1" />
<link href="html_libraries/bootstrap-3.3.5/css/lumen.min.css" rel="stylesheet" />
<script src="html_libraries/bootstrap-3.3.5/js/bootstrap.min.js"></script>
<script src="html_libraries/bootstrap-3.3.5/shim/html5shiv.min.js"></script>
<script src="html_libraries/bootstrap-3.3.5/shim/respond.min.js"></script>
<script src="html_libraries/navigation-1.1/tabsets.js"></script>
<link href="html_libraries/highlightjs-9.12.0/default.css" rel="stylesheet" />
<script src="html_libraries/highlightjs-9.12.0/highlight.js"></script>
<script src="html_libraries/htmlwidgets-1.5.1/htmlwidgets.js"></script>
<script src="html_libraries/plotly-binding-4.9.2.1/plotly.js"></script>
<script src="html_libraries/typedarray-0.1/typedarray.min.js"></script>
<link href="html_libraries/crosstalk-1.1.0.1/css/crosstalk.css" rel="stylesheet" />
<script src="html_libraries/crosstalk-1.1.0.1/js/crosstalk.min.js"></script>
<link href="html_libraries/plotly-htmlwidgets-css-1.52.2/plotly-htmlwidgets.css" rel="stylesheet" />
<script src="html_libraries/plotly-main-1.52.2/plotly-latest.min.js"></script>

<style type="text/css">code{white-space: pre;}</style>
<style type="text/css">
  pre:not([class]) {
    background-color: white;
  }
</style>
<script type="text/javascript">
if (window.hljs) {
  hljs.configure({languages: []});
  hljs.initHighlightingOnLoad();
  if (document.readyState && document.readyState === "complete") {
    window.setTimeout(function() { hljs.initHighlighting(); }, 0);
  }
}
</script>



<style type="text/css">
h1 {
  font-size: 34px;
}
h1.title {
  font-size: 38px;
}
h2 {
  font-size: 30px;
}
h3 {
  font-size: 24px;
}
h4 {
  font-size: 18px;
}
h5 {
  font-size: 16px;
}
h6 {
  font-size: 12px;
}
.table th:not([align]) {
  text-align: left;
}
</style>




<style type = "text/css">
.main-container {
  max-width: 940px;
  margin-left: auto;
  margin-right: auto;
}
code {
  color: inherit;
  background-color: rgba(0, 0, 0, 0.04);
}
img {
  max-width:100%;
}
.tabbed-pane {
  padding-top: 12px;
}
.html-widget {
  margin-bottom: 20px;
}
button.code-folding-btn:focus {
  outline: none;
}
summary {
  display: list-item;
}
</style>



<!-- tabsets -->

<style type="text/css">
.tabset-dropdown > .nav-tabs {
  display: inline-table;
  max-height: 500px;
  min-height: 44px;
  overflow-y: auto;
  background: white;
  border: 1px solid #ddd;
  border-radius: 4px;
}

.tabset-dropdown > .nav-tabs > li.active:before {
  content: "";
  font-family: 'Glyphicons Halflings';
  display: inline-block;
  padding: 10px;
  border-right: 1px solid #ddd;
}

.tabset-dropdown > .nav-tabs.nav-tabs-open > li.active:before {
  content: "&#xe258;";
  border: none;
}

.tabset-dropdown > .nav-tabs.nav-tabs-open:before {
  content: "";
  font-family: 'Glyphicons Halflings';
  display: inline-block;
  padding: 10px;
  border-right: 1px solid #ddd;
}

.tabset-dropdown > .nav-tabs > li.active {
  display: block;
}

.tabset-dropdown > .nav-tabs > li > a,
.tabset-dropdown > .nav-tabs > li > a:focus,
.tabset-dropdown > .nav-tabs > li > a:hover {
  border: none;
  display: inline-block;
  border-radius: 4px;
  background-color: transparent;
}

.tabset-dropdown > .nav-tabs.nav-tabs-open > li {
  display: block;
  float: none;
}

.tabset-dropdown > .nav-tabs > li {
  display: none;
}
</style>

<!-- code folding -->




</head>

<body>


<div class="container-fluid main-container">




<div class="fluid-row" id="header">






<p>&nbsp;</p>
<p>&nbsp;</p>
<!-- tabsets --><!-- code folding -->
<div class="container-fluid main-container">
<div id="header" class="fluid-row">
<h1 class="title toc-ignore">Monitoreo del Contagio de COVID-19 en M&eacute;xico: Numeros B&aacute;sicos de Reproducci&oacute;n en el tiempo</h1>
</div>
<blockquote>
<p>Responsables: Dr. <a title="E mail: alfonso.mendoza@upaep.mx" href="mailto:alfonso.mendoza@upaep.mx">Alfonso Mendoza Vel&aacute;zquez</a> Mtro. <a title="E mail: herberto.rodriguez@upaep.mx" href="mailto:herberto.rodriguez@upaep.mx">Herberto Rodr&iacute;guez</a></p>
<p>Analistas: Luis Miguel Contla; Luis Enrique Mu&ntilde;oz; Luis Enrique Ju&aacute;rez C&eacute;sar; Isaac Mata</p>
<p>Centro de Investigaci&oacute;n e Inteligencia Econ&oacute;mica (CIIE)</p>
<p>Universidad Popular Aut&oacute;noma del Estado de Puebla (UPAEP)</p>
</blockquote>
<h2 class="tabset tabset-fade tabset-pills">&nbsp;</h2>
<!--
See https://github.com/rstudio/flexdashboard/issues/80#issuecomment-247139450
on generating tabs in rmarkdown automatically
-->
<div id="world" class="section level3">
<h3>World</h3>
<div><a style="display: block; text-align: center;" title="Plot 4" href="https://plotly.com/~luisenrique97/4/" target="_blank" rel="noopener"><img style="max-width: 100%; width: 600px;" src="https://plotly.com/~luisenrique97/4.png" alt="Plot 4" width="600" /></a></div>
<div><a style="display: block; text-align: center;" title="Plot 5" href="https://plotly.com/~AlfonsoMendoza/5/?share_key=Av9j8yDzsfdfgB1cs2lctr" target="_blank" rel="noopener"><img style="max-width: 100%; width: 600px;" src="https://plotly.com/~AlfonsoMendoza/5.png?share_key=Av9j8yDzsfdfgB1cs2lctr" alt="Plot 5" width="600" /></a></div>
<div id="us" class="section level3">
<h3>US</h3>
<div id="htmlwidget-a2a924b14dbb34df8fb9" class="plotly html-widget" style="width: 960px; height: 480px;">&nbsp;</div>
</div>
<div id="section-1" class="section level2">
<h2>N&uacute;mero Reproductivo B&aacute;sico (Rt)&nbsp;&nbsp;</h2>
<p>El N&uacute;mero Reproductivo B&aacute;sico (<em>Rt</em>) muestra la velocidad de propagaci&oacute;n de la pandemia por Covid19 en las entidades federativas de M&euml;xico (Ridenhour et al., 2018). Identificar la evoluci&oacute;n de este indicador puede apoyar la toma de decisiones y las estrategias de pol&iacute;tica p&uacute;blica local en el combate contra esta enfermedad.&nbsp;</p>
<p>La pol&iacute;tica de salud deber&iacute;a mantener a Rt&lt;1 para lograr que la poblaci&oacute;n se encuentre fuera del escenario de pandemia. El umbral de epidemia se alcanza cuando m&aacute;s de una persona se infecta por cada infectado, es decir cuand Rt&gt;1.</p>
<p>Las gr&aacute;ficas muestran los c&aacute;lculos de contagio por Covid-19 para las 32 entidades federativas de M&eacute;xico. En particular se muestran el N&uacute;mero Reproductivo B&aacute;sico Diario (<em>Rt</em>) en el d&iacute;a <em>t</em> (eje vertical primario) y&nbsp;la tasa de contagios diarios (eje vertical secundario).&nbsp;</p>
<p>Los n&uacute;meros de reproducci&oacute;n pueden ser estimados en distintos momentos durante la pandemia, por lo que son dependientes del tiempo (Obadia et al. 2012).</p>
<p>Una estimaci&oacute;n adecuada del par&aacute;metro de transmisi&oacute;n Rt puede ser &uacute;til en el c&aacute;lculo de la tasa de ataque (el porcentaje de la poblaci&oacute;n infectada a partir de la poblaci&oacute;n suceptible inicial). Tambi&eacute;n puede emplearse para el c&aacute;lculo de la tasa de crecimiento del n&uacute;mero de contagios<h3><strong>Nota metodol&oacute;gica</strong></h3>
<p>El N&uacute;mero Reproductivo B&aacute;sico (Rt) se calcula por el m&eacute;todo bayesiano de Bettencourt et al. (2008) mediante M&aacute;xima Verosimilitud. Este procedimiento asume que los contagios en el tiempo siguen una distribuci&oacute;n Gamma con dos par&aacute;metros (tama&ntilde;o y forma). La rutina es provista por Boelle y Obadia (2015). El criterio de optimizaci&oacute;n encuentra los estimadores de Rt, tama&ntilde;o y forma que m&aacute;ximizan la funci&oacute;n de verosimilitud. Este procedimiento requiere cuando la incidencia alcanza 150 casos o m&aacute;s.</p>
<p>La fuente de los datos diarios de contagio se obtiene de la Direcci&oacute;n General de Epidemiolog&iacute;a&nbsp; (<a href="https://coronavirus.gob.mx/datos/#DownZCSV">datos abiertos Direcci&oacute;n General de Epidemiolog&iacute;a</a>).&nbsp;</p>
<div id="notes" class="section level3">
<h3>Notes</h3>
<ul>
<li>
<p>We estimate the (effective) <strong>reproduction number</strong> <em>R(t)</em> at day <em>t</em>, i.e. the average number of people someone infected at time <em>t</em> would infect if conditions remained the same.</p>
</li>
<li>
<p>The <strong>estimator</strong> has been taken from <a href="#ref1">(Fraser 2007)</a>. It compares the number of infections at a time point with the number of infectious cases at that time, weighted by their respective infectivity. Note that constant (per country) <strong>underreporting</strong> does not affect the estimates since both the number of infections and the number of infectious persons are reduced by the same proportionality factor.</p>
</li>
<li>
<p>For this estimator, we derived (approximate, pointwise) <strong>95% confidence intervals</strong> using the delta method.</p>
</li>
<li>
<p>However, the size of the confidence intervals reflects only those statistical uncertainties due to the random dynamics of the epidemic. But since the estimator is based on assumptions about the infectivity of the virus, and given that the data are not perfect because of a change of reporting criteria, varying amounts of testing etc., <strong>the estimates should be interpreted cautiously</strong> and not be taken at face value (especially when case counts are low). Still, we believe that one can draw qualitatively credible conclusions from them.</p>
</li>
<li>
<p>Estimates are shown in black, confidence intervals as grey stripes, with values specified by the <strong>left axis</strong> (on a <strong>log-scale</strong>; thus 0 is always out of sight, at the infinite lower end of the axis). If estimates cannot sensibly be determined due to insufficient data, values are interpolated by dashed lines without confidence intervals.</p>
</li>
<li>
<p>The <strong>critical value</strong> for the reproduction number is 1, shown as a red horizontal line: a value larger than one would result in an exponential increase of infections, a value smaller than one in a decrease.</p>
</li>
<li>
<p>The analysis is based on <strong>newly reported cases</strong> of Coronavirus Disease 2019 (COVID-19) per day, shown as blue bars as specified by the <strong>right axis</strong> (on a linear scale). For these we rely on the <a href="https://github.com/CSSEGISandData/COVID-19">data provided by Johns Hopkins University</a>.</p>
</li>
<li>
<p>For the estimated reproduction number (black line, left vertical axis), the horizontal axis specifies the corresponding date of infection. For the newly reported cases (blue bars, right axis), it specifies the date the cases were reported. Mondays are marked by thin vertical lines.</p>
</li>
<li>
<p>The graphics are <strong>updated daily</strong> (last update: 01/07/20 07:00 GMT), showing data up to yesterday.</p>
</li>
<li>
<p>Note that cases are reported much later than the corresponding day of infection, namely after incubation time (about 5 days <a href="#ref2">(WHO 2020)</a>) plus some more days necessary for testing and reporting the case to the authorities. For simplicity we assume that cases are reported 7 days after infection. Therefore, estimates for the reproduction number <strong>lag one week behind</strong> the reporting of new cases.</p>
</li>
<li>
<p>In a population where no countermeasures have been put into place, the so-called <strong>basic reproduction number</strong> <em>R<sub>0</sub></em> is believed to be given by some value between 2.4 and 4.1 <a href="#ref3">(Read et al. 2020)</a>. Estimates higher than that might be explained by a considerable number of <strong>imported cases</strong>.</p>
</li>
<li>
<p><strong>Details</strong> may be found in the accompanying <a href="reports/repronum/repronum.pdf">Technical Report</a> <a href="#ref4">(Hotz et al. 2020)</a>; the <strong>code</strong> is available <a href="https://github.com/Stochastik-TU-Ilmenau/COVID-19/blob/gh-pages/estimator.r">here</a>.</p>
</li>
</ul>
</div>
<div id="references" class="section level3">
<h3>References</h3>
<p><a name="ref1"></a>[1]: Fraser, C. (2007). <em>Estimating Individual and Household Reproduction Numbers in an Emerging Epidemic.</em> PLOS ONE 2 (8), <a href="https://doi.org/10.1371/journal.pone.0000758">https://doi.org/10.1371/journal.pone.0000758</a>.</p>
<p><a name="ref2"></a>[2] WHO (2020). Report of the WHO-China Joint Mission on Coronavirus Disease 2019 (COVID-19), <a href="https://www.who.int/publications-detail/report-of-the-who-china-joint-mission-on-coronavirus-disease-2019-(covid-19)">https://www.who.int/publications-detail/report-of-the-who-china-joint-mission-on-coronavirus-disease-2019-(covid-19)</a>.</p>
<p><a name="ref3"></a>[3]: Read, J.M., Bridgen, J.R.E., Cummings, D.A.T., Ho, A., Jewell, C.P. (2020). <em>Novel coronavirus 2019-nCoV: early estimation of epidemiological parameters and epidemic predictions.</em> MedRxiv, Version 2, 01/28/2020, <a href="https://doi.org/10.1101/2020.01.23.20018549">https://doi.org/10.1101/2020.01.23.20018549</a>.</p>
<p><a name="ref4"></a>[4]: Hotz, T., Glock, M., Heyder, S., Semper, S., B&ouml;hle, A., Kr&auml;mer, A. (2020). <em>Monitoring the spread of COVID-19 by estimating reproduction numbers over time.</em> <a href="https://arxiv.org/abs/2004.08557">arXiv:2004.08557</a>, 18/04/2020.</p>
<p>&nbsp;<strong>Bettencourt, L.M.A., and R.M. Ribeiro. "Real Time Bayesian Estimation of the Epidemic Potential<br />of Emerging Infectious Diseases." PLoS One 3, no. 5 (2008): e2185.</strong></p>
<p>&nbsp;Obadia et al. BMC Medical Informatics and Decision Making 2012, 12:147<br />http://www.biomedcentral.com/1472-6947/12/147</p>
<p><em><a href="impressum.html#imprint">Imprint</a></em></p>
</div>
</div>
</div>
<!-- tabsets --> <!-- code folding --> <!-- dynamically load mathjax for compatibility with self-contained --></div>